[
  "obsidian-editor-shortcuts",
  "colored-text",
  "cmdr",
  "editor-width-slider",
  "obsidian-image-auto-upload-plugin",
  "heycalmdown-navigate-cursor-history",
  "obsidian-style-settings",
  "highlightr-plugin",
  "html-tabs",
  "code-styler"
]