# *Cpp Programming language*


<br/>


## 目录

- [Namespace](#namespace)
  - [命名空间的定义](#命名空间的定义)
  - [匿名命名空间](#匿名命名空间)
  - [匿名命名空间中的 extern](#匿名命名空间中的-extern)
  - [作用域](#作用域)
    - [显式的引用某一处的作用域](#显式的引用某一处的作用域)
  - [命名空间下成员的声明和定义](#命名空间下成员的声明和定义)
- [表达式和值类别](#表达式和值类别)
  - [表达式](#表达式)
  - [值类别](#值类别)
    - [左值](#左值)
    - [右值](#右值)
    - [值类别小结](#值类别小结)
- [引用](#引用)
  - [引用变量的本质](#引用变量的本质)
  - [左值引用](#左值引用)
  - [右值引用](#右值引用)
  - [左右值引用的函数重载策略](#左右值引用的函数重载策略)
  - [数组引用](#数组引用)
  - [指针引用](#指针引用)
- [常量的增强](#常量的增强)
- [类型赋值](#类型赋值)
  - [匿名对象](#匿名对象)
  - [定义法](#定义法)
  - [隐式法](#隐式法)
  - [括号法](#括号法)
  - [new](#new)
    - [语义使用时必须要注意的问题](#语义使用时必须要注意的问题)
    - [语义用于修饰一个数组类型的构造](#语义用于修饰一个数组类型的构造)
    - [布置-new](#布置-new)
  - [delete](#delete)
- [类](#类)
  - [访问权限符](#访问权限符)
  - [this-和-base](#this-和-base)
  - [类中的成员的声明和定义](#类中的成员的声明和定义)
  - [成员函数和函数指针](#成员函数和函数指针)
  - [构造函数](#构造函数)
    - [拷贝构造函数](#拷贝构造函数)
    - [移动构造函数](#移动构造函数)
    - [编译器自动添加的拷贝构造函数和拷贝复制运算符](#编译器自动添加的拷贝构造函数和拷贝复制运算符)
    - [拷贝移动消除](#拷贝移动消除)
    - [explicit关键字](#explicit关键字)
    - [构造函数中的初始化参数列表](#构造函数中的初始化参数列表)
    - [构造函数中的初始化参数列表](#构造函数中的初始化参数列表)
  - [析构函数](#析构函数)
  - [关于类中的静态成员](#关于类中的静态成员)
    - [静态成员的声明和实现](#静态成员的声明和实现)
  - [常函数和常对象](#常函数和常对象)
    - [常函数](#常函数)
    - [常对象](#常对象)
    - [mutable](#mutable)
  - [类的前置声明](#类的前置声明)
  - [继承](#继承)
    - [继承的内存模型](#继承的内存模型)
    - [子类和父类实例的释放顺序(析构函数的调用顺序)](#子类和父类实例的释放顺序(析构函数的调用顺序))
    - [显示指定父类构造函数进行父类成员的初始化工作](#显示指定父类构造函数进行父类成员的初始化工作)
    - [引用父类中的成员](#引用父类中的成员)

类的前置声明主要作用于防止编译器由于代码呈上至下的编译方式导致某些时候对于一些类的使用无法访问的情况，<font color = "red">对于一段前置声明的类来说，如果在出现该类的具体定义之前的地方去使用它是无法访问里面的成员的，因为其只是作用于一段声明</font>，我们通常用它来声明一个该前置声明类型的指针

```cpp
#include <iostream>
using namespace std;

/* 前置声明 Person 类 */
class Person;

/* 利用前置声明构造一个 Person 类的指针 */
Person *per;

void foo() {
  /* error */
  /* 由于在出现 Person 的具体定义之前使用了该指针，故这里会导致编译报错 */
  per = new Person(100);
}

class Person {
public:
  int age;

  Person(int _age): age(_age) {}
};

int main(void) {
  /* success */
  /* 在使用 per 的时候已经出现了 Person 类的定义，故这里能够成功调用 */
  per = new Person(0x400);
  cout << per->age << endl;

  return EXIT_SUCCESS;
}
```

<br/>

<span id = "继承"></span>

### 继承

---

c++ 的继承方式和其余的 OOP 语言一致，其语法为 : <font color = "red">class derived-class : access-specifier base-class</font>
- derived-class: 子类

- base-class : 基类

- access-specifier : 继承类别

在这里，其实重点需要说明的就是这个继承类别，一个基类可以被继承自 public, protected, private 这三种类别，不同的继承类别能够决定基类延伸至子类中的成员其访问保护性，简而言之就是可以间接的改变基类中成员的访问修饰符，<font color = "red">一般而言，我们使用继承都是用的 public 的形式来完成，因为这个形式是最直接的</font>

- 公有继承(public) : 当一个类派生自公有基类时，基类的公有成员也是派生类的公有成员，基类的保护成员也是派生类的保护成员，基类的私有成员不能直接被派生类访问，但是可以通过调用基类的公有和保护成员来访问

- 保护继承(protected) : 当一个类派生自保护基类时，基类的公有和保护成员将成为派生类的保护成员

- 私有继承(private) : 当一个类派生自私有基类时，基类的公有和保护成员将成为派生类的私有成员

<br/>

<span id = "继承的内存模型"></span>

#### 继承的内存模型

一个存在继承派生关系的派生类在实例化的过程中，会先初始化其父类的所有成员(**_无视访问修饰符_**)到一段内存中，然后再以这段内存为基础继续往下初始化上级基类往下所派生的子类的成员，直至初始化自己，<font color = "red">也就是说，一个类的实例如果存在基类，那么其在内存中的首地址往下所延伸的地址都是先由其基类中的成员所占用，然后以基类成员所占用的内存地址的结束为基准，继续往下才是子类的成员所存储的内存地址，如下面的代码</font>

```cpp
class person_base {
private:
    char m_gender = 1;
};

class student : public person_base {
public:
    int m_age;
    char m_id = 1;
};
```

其在内存中的模型如下图所示

```text
                                +---------+
                          +-----+0000 0000|
                          |     +-----------> 0x0000000B
                          |     |0000 0000|
        student::m_id <---+     +-----------> 0x0000000A
                          |     |0000 0000|
                          |     +-----------> 0x00000009
                          +-----+0000 0000|
                                +-----------> 0x00000008
                          +-----+0000 0000|
                          |     +-----------> 0x00000007
                          |     |0000 0000|
       student::m_age <---+     +-----------> 0x00000006
                          |     |0000 0000|
                          |     +-----------> 0x00000005
                          +-----+0000 0000|
                                +-----------> 0x00000004
                          +-----+0000 0000|
                          |     +-----------> 0x00000003
                          |     |0000 0000|
person_base::m_gender <---+     +-----------> 0x00000002
                          |     |0000 0000|
                          |     +-----------> 0x00000001
                          +-----+0000 0000|
                                +-----------> 0x00000000
```

通过 vs 开发人员工具输入 `cl /d1 reportSingleClassLayout__(类型) __(文件名)` 来查看的结果

```text
class student   size(12):
  +---
0 | +--- (base class person_base)
0 | | m_gender
  | +---
  | <alignment member> (size=3)
4 | m_age
8 | m_id
  | <alignment member> (size=3)
  +---
```

在这里由于内存对齐的问题，故原本存在于基类中的类型为 char 的成员(`m_gender`)的内存占用的为4个字节，不过这里不进行额外的展开，详情请参考 [这一篇文章](#https://github.com/NGPONG/document/blob/master/C/2019/12_18/C_Programming_Language.md#%E5%85%B3%E4%BA%8E%E7%BB%93%E6%9E%84%E4%BD%93%E7%9A%84%E5%86%85%E5%AD%98%E5%AF%B9%E9%BD%90%E7%9A%84%E9%97%AE%E9%A2%98)，需要额外说明一下的是，<font color = "red">基类是一个复合类型，而派生类继承自基类中的成员无非就是把基类中的成员初始化在派生类中所在的内存段当中，即，它们是一体的，所以我们在计算基类中的成员的偏移位置所需的 **_对齐单位_** 的参考并不是以派生类的视角为基准，而是以基类的视角所构成的 **_对齐单位_** 为准，这里要和直接声明在类中的类型为复合类型的成员不同，对于它们去计算在内存中的偏移单位时，对齐单位 的参考是以当前复合类型的视角为基准</font>

其实我们通过继承与派生在内存中的模型，我们可以总结为 : <font color = "red">子类派生自父类，实质上它是继承了父类中所有的成员(无视访问修饰符)(非实例构造型函数，如: 构造函数, 析构函数, 等号运算符重载函数)</font>，<font color = "red">一个子类在实例创建的过程中，会 **_优先_** 初始化其所继承的父类(默认情况下调用父类的默认构造函数)中的所有成员至以子类实例为基准所构建的内存段的起始位置上，然后在 以父类中的成员所构建的数据所在内存地址的结束位置 继续往下初始化子类中的成员数据</font>

<font color = "red">需要严格说明的是，派生类在实例创建的过程中并 **_不是_** 又在内存中创建了一份父类的实例，然后子类通过某种方式 **_'引用'_** 了这个在不同内存段中的基类以达到访问基类中的成员的目的</font>，继承只是一个语言在抽象上的概念，通过这种抽象的 **_'继承关系'_** 来把派生和基类区分开来，实质上基类在确定好其派生关系后，其所有的成员在内存中的数据都会在派生类创建的过程中把它们优先初始化在以子类为基准的内存段上，我们可以从 **_'派生类的视角'_** 理解为：派生类和基类是一体的

有了 cpp 中类的内存模型为基准，我们可以进行一个有趣的实验 : 我们都知道，派生类所继承自基类中的成员会受到基类中成员声明的访问修饰符的影响的，也就意味着基类中某个声明为私有的成员在其派生类中是无法通过直接的方式去访问的，当然这里重点强调的是 **_'直接'_**，上面对于继承的内存模型我们会发现，实际上基类中的所有成员是存储在派生类的实例其所对应的内存段当中，那么我们可以大胆的认为基类中声明为 `private` 的成员实际上并不是 `private` 的，因为我们完全可以通过一个派生类的内存首地址，通过地址偏移的方式找到那个声明为 `private` 的在基类的成员其在内存中的首地址，然后通过解引用的方式以操作它，事实的确如此，再次强调的是，<font color = "red">继承只是语言上的一个抽象的功能，是编译器层面上为了使我们更方便去编写 oop 的工程项目所提供的功能，实际上我们要怎么玩完全由开发人员来决定</font>

```cpp
class person_base {
private:
  char m_gender = 'K';
};

class student : public person_base {
public:
  int m_age;
  char m_id;

public:
  void printp(void) {
    printf("%c\n", *(char *)this);
  }
};
```

<br/>

<span id = "子类和父类实例的释放顺序(析构函数的调用顺序)"></span>

#### 子类和父类实例的释放顺序(析构函数的调用顺序)

子类的实例在被释放的时候，会先释放掉子类中的成员(调用子类的析构函数)，然后再去释放其所继承自父类中的成员(调用父类的析构函数)，<font color = "red">造成这种原因主要是因为 栈 的 FIFO 的机制所导致的</font>，前面在[继承的内存模型](#继承的内存模型)中提到，一个子类在进行实例化的过程中，会先初始化其父类中的成员至子类的内存段中，然后去初始化子类中的成员，也就是说子类的初始化顺序是在其父类中的成员初始化完毕后发生的，所以在子类即将被释放的时候，也会先释放掉子类中的成员然后再去释放掉其所继承下来的父类中的成员

我们可以把这个类的构造和析构的过程理解成一个盖房子的工作，再开始之前，我们往往需要设定一份蓝图，然后从外部开始建造，建造完毕后开始装填内部的装饰，而拆卸时的顺序则反之

<br/>

<span id = "显示指定父类构造函数进行父类成员的初始化工作"></span>

#### 显示指定父类构造函数进行父类成员的初始化工作

子类在实例化的过程中会先初始化其所继承下来的父类中的成员，即调用父类中的构造函数，如在没有进行显式指定的情况下，编译器对此的调用都是父类中的 **_默认构造函数_**，那么，当我们在子类中并没有显式的指定父类初始化所需的构造函数，并且父类中有一个我们所自定义的构造函数时，子类在进行实例化时就会失败，原因在于当我们在父类中自定义了一个构造函数后，编译器就不会为其再去提供一个默认的构造函数，那么这个子类在进行实例化的过程中，由于编译器找不到其父类的默认构造函数所以报错了，解决这一办法只需要在其父类中添加一个默认的构造函数即可解决，当然更推荐的做法则为在子类的构造函数的 [初始化列表](#构造函数中的初始化参数列表) 中显示指定其父类初始化所需使用的构造函数即可解决 ： <font color = "red">basic(type1.type2,……)</font>，<font color = "red">在这里需要注意的是，我们尽量保证显式指定基类的构造函数调用要放在初始化列表的最前面，虽然不遵守这一规则也能够编译通过并正常使用，但是这样的话就不太符合派生类的实例在初始化的过程中会先初始化其父类然后再初始化派生类中的成员这一逻辑关系了(只是看着不像，并不意味着我们这们写会造成先初始化派生类内部的成员)</font>

```cpp
#include <iostream>
using namespace std;

class Person {
public:
  int id;
  Person(int _id) : id(_id) { }
};

class Student : public Person {
public:
  const char *name;

  Student(const char *_name) : Person::Person(30), name(_name) {
    cout << "Person id = " << Person::id << endl;
    cout << "Student name = " << this->name << endl;
  }
};

int main(void) {
  Student stu("hello,world");

  return EXIT_SUCCESS;
}
```

<br/>

<span id = '引用父类中的成员'></span>

#### 引用父类中的成员

**_关于一段继承体系中，调用存在二义性的问题_**

在一个类所属的一段继承关系中，我们要保证成员之间的调度不会出现二义性的问题，对于 : 

- 派生类和基类中存在名字相同的成员的时候，调用会存在二义性，编译器会直接隐藏掉基类中会因为此次调用而造成二义性冲突的成员(如果是所冲突的成员为函数，则隐藏掉其包括所有重载的版本)，也就意味着可能我们本次针对该成员的调用是想访问在其基类实例中该成员的信息，但是实际上获取到的却是当前派生类实例中该成员的信息

- 派生类所继承的多个基类中存在同名成员时，调用会存在二义性，因为编译器并不知道该调用到底是针对派生类继承的基类 **__basicA_** 中的成员亦或者说继承的基类 **__basicB_** 中的成员，故针对这种情况下编译器会直接报错，导致编译不通过

- 当一个派生类中同时存在以上两种情况的继承关系时，第一种情景会优先覆盖掉第二种情景所发生的问题

**_显式的引用父类中的成员_**

为了解决上面所提到的 **_关于一段继承体系中，调用存在二义性的问题_** 问题，我们可以在调用时显示的指定当前所调用成员具体是在哪个所属基类的作用域下，如下面的代码所示 : 

```cpp
class person_base {
public:
  char m_gender = 'K';
  const static int s_id = 0x80;

public:
  void fun_test(void) {
    cout << "Hello,person_base" << endl;
  }
  void fun_test(int a) {
    cout << a << endl;
  }
};

class student : public person_base {
public:
  int m_age;
  char m_gender = 'o';
  const static int s_id = 0x400;

public:
    void fun_test(void) {
        cout << "Hello,student" << endl;
    }
};
int main(void) {
  student stu;

  stu.m_gender;
  stu.person_base::m_gender;      /* 显示的调用父类中的普通变量成员 */

  stu.s_id;
  student::s_id;
  stu.person_base::s_id;          /* 显示的调用父类中的静态变量成员 */
  student::person_base::s_id;     /* 显示的调用父类中的静态变量成员 */
  student::person_base::s_id;     /* 显示的调用父类中的静态变量成员 */
  person_base::s_id;          

  stu.fun_test();
  stu.person_base::fun_test();    /* 显示的调用父类中的函数成员 */
  stu.person_base::fun_test(1);   /* 显示的调用父类中的函数成员 */

   return EXIT_SUCCESS;
}
```

当然，对于 :: 操作符去引用具体基类作用域的作用并不单单只是通过子类的实例来完成显示调用其基类中的成员的目的，我们在子类的实例的上下文中，同样可以直接通过 :: 去引用其基类的作用域以达到在子类的上下文中使用 **_base_** 的效果(<font color = "red">cpp中并没有 **_base_** 指针，但是可以通过这种方式来达到 **_base_** 指针的效果</font>)

```cpp
class person_base {
public:
  char m_gender = 'K';
};

class student : public person_base {
public:
  int m_age;
  char m_gender = 'o';

public:
  student() {
    person_base::m_gender = 'Z';
    cout << person_base::m_gender << endl;

    this->m_gender = 'Q';
    cout << this->m_gender << endl;
  }
};
```

<br/>

<span id = "里式转换"></span>

#### 里式转换

里式转换这一概念其实并不陌生，我们在其它的 OOP 语言中也看到过这个概念，而 cpp 中同样遵循着这一规律，即 : 

- 基类的 **_指针_** 可用于接收一个子类实例的内存地址(<font color = "red">向上类型转换</font>)

- 当基类的 **_指针_** 所指向的是一个子类的实例在内存中的地址，那么这个基类指针可以强转为子类指针(<font color = "red">向下类型转换</font>)

上面所提到的都是 **_指针类型_** 可遵循，<font color = "red">其实也就是说 **_引用类型_** 同样也可以适用</font>，因为引用类型其实质就是一个指针

为什么指针类型为基类的指针可用于接收一个子类实例的地址？通过[继承的内存模型](#继承的内存模型)一节中，我们可以知道，基类中的成员数据会从其派生在内存中的首地址开始优先构建的，那么<font color = "red">当我们用一个基类类型的指针去接收一个子类实例在内存中的首地址的时候，是没有任何问题的，因为我们只是通过基类类型的指针去改变了指针解引用的步长限定在子类在内存段中，独属于基类成员数据的那段内存的范围内，即仅仅是操作针对于该派生的基类内部所保有的成员数据，反之，一个合法的指针(基类的指针所指向的地址是一个子类的实例)也同样是能够用于强转为子类指针，因为该操作同样也仅仅只是改变了指针的解引用方式，使之解引用的步长能够扩散到整个派生类所占用的范围，这是一种 **_安全的转换关系_**</font>，我们要明白的是，<font color = "red">指针的类型永远只是用来衡量解引用操作在内存段中所需的偏移量，并不意味着指针的类型就代表了整个实例的本身</font>，那么反过来，<font color = "red">一个派生类类型的指针是否可以接收其基类实例在内存中的地址呢？答案肯定是 **_不可以的_**，因为作为派生类所继承下来的基类中的成员这个是属于它们之间的共性，基类中的成员的数据往往能够且足够被包含在子类实例所指向的内存空间内，但是作为派生往往存在着它的一些特性，简而言之就是一个派生类在内存中的内存单元通常都是要比其基类要大的，那么当我们使用一个偏移步长为派生类的指针去对一个内存长度小于或者等于派生类步长的基类实例做解引用操作的时候，就会发生内存越界的情况，是一种 **_不安全的操作_**</font>

```cpp
#include <iostream>
using namespace std;

class person_base {
public:
  char m_gender = 'K';
};

class student : public person_base {
public:
  int m_age = 10;
};

int main(void) {
  student stu_stack;
  person_base *base_1 = &stu_stack;

  person_base *base_2 = new student();
  student *stu_heap = (student *)base_2;

  return EXIT_SUCCESS;
}
```

其实单纯的类类型也符合这一规律，即，基类可以接收一个子类的实例用于初始化，当基类的实例是通过子类来初始化完成，那么在子类 拥有符合条件的构造函数的情况下(由于需要构成对于子类的，故派生类中需要有一个基类引用作为形参的构造函数)可以完成基类强转为派生类，但是需要注意的是，这种转换关系所依赖的是基类中的 拷贝/移动构造(即形参为基类的引用)(基类接收一个子类的实例用于初始化)亦或者通过子类中 拥有符合条件的构造函数(基类强转为派生类)来完成的，即<font color = "red">该转换方式是会丢失掉子类中的成员数据的，那么在一个基类并不保有子类的成员数据的情况下，这种转换同样也是不符合多态的</font>，<font color = "red">在这种转换情境之下，真正符合多态的定义仅仅只是在把子类的实例用作于基类构造时，因为基类构造的形参是基类的引用并引用了一个派生类的实例</font>

```cpp
#include <iostream>
using namespace std;

class person_base {
public:
  char m_gender = 'K';

  person_base() {}

  person_base(person_base &per) {
    this->m_gender = per.m_gender;
  }

  person_base(person_base &&per) {
    this->m_gender = per.m_gender;
  }
};

class student : public person_base {
public:
  int m_age = 10;

  student() : person_base(*this){};

  student(person_base &per) {
    this->m_age = 10;
  }
};

int main(void) {
  person_base base = student();

  student stu = (student)base;

  return EXIT_SUCCESS;
}
```

<br/>

<span id = "菱形继承"></span>

#### 菱形继承

菱形继承关系，即最下级派生类所继承的多个基类是共同派生自同一个最上级基类，这时候就会造成一些问题 : 

1. 由于最下级派生类所继承的多个基类都是继承自同一个最上级基类，故它们所继承自最上级基类中的属性其实以最下级派生类的眼光来看待的话，是存在 **_属性重复_** 的问题的，如下图，最上级基类保有一个 `SEX` 性别的成员，而其下级派生类中由于继承自 `ANIMAL` 最上级基类的关系，它们同样都拥有着 `SEX` 性别的成员，但是如果把继承的体系继续延伸到 ANIMAL 的二级派生类(最下级派生类) `BYBIRD` 时，`BYBIRD` 所继承自 `DOG` 和 `CAT` 身上的 `SEX` 成员属性(原始来源 ANIMAL)是存在重复的，因为即使是 杂交动物(`BYBIRD`) 也只能有一个性别的属性

2. 由于 `HYBIRD` 的直接上级父类 `DOG` 和 `CAT` 中都保有相同的属性 `SEX`，故当我们想通过 `HYBIRD` 的实例去获取其父类的属性 `SEX` 时就会造成二义性的问题，并且这种二义性问题的情景会直接导致编译失败

```cpp
class ANIMAL {
public:
  char SEX;
};

class DOG : public ANIMAL { };

class CAT : public ANIMAL { };

class HYBIRD : public DOG, public CAT { };
```

```text
                    ANIMAL
                 +----------+
+----------------+-> SEX <--+-----------------+
|                +----+-----+                 |
|                     |                       |
|                     |                       |
|                     |                       |
|                     |                       |
|        +------------+-------------+         |
|        |                          |         |
|        |                          |         |
|        v                          v         |
|       DOG                        CAT        |
|   +----------+               +----------+   |
+-----> SEX    |               |   SEX <------+
    +----+-----+               +----+-----+
         |                          |
         |                          |
         |                          |
         +------------+-------------+
                      |
                      |
                      v
                    HYBIRD
                 +----------+
                 |          |
                 +----------+

------------------------------------------------------+
                                                      |
class HYBIRD   size(2):                               |
   +---                                               |
 0 | +--- (base class DOG)                            |
 0 | | +--- (base class ANIMAL)                       |
 0 | | | SEX                                          |
   | | +---                                           |
   | +---                                             |
 1 | +--- (base class CAT)                            |
 1 | | +--- (base class ANIMAL)                       |
 1 | | | SEX                                          |
   | | +---                                           |
   | +---                                             |
   +---                                               |
------------------------------------------------------+
```

虽然我们可以采用 `::` 引用具体某个基类作用域的方式去解决 **_第二类导致编译失败的问题_**，但是这样做所导致的只是 '程序上' 没有问题，设计上却没有遵循 'OOP' 规范，故更好的做法是采用 <font color = "red">**_虚基类继承_**</font>

<br/>

<span id = "虚继承"></span>

#### 虚继承

在继承基类时通过关键字 `virtual` 来声明当前所继承的基类是一个 <font color = "red">**_虚基类_**</font>，而这种继承虚基类的继承方式则称为 <font color = "red">**_虚继承_**</font>

<font color = "red">一个派生类通过虚继承的方式继承了某个虚基类时，派生类所继承的虚基类中的成员是被 **_共享_** 的，当然这种共享关系的视角是由继承虚基类的派生类继续往下延生的派生才能得以体现</font>，也就是说，继承自虚基类的派生类往下所衍生到的派生其实例的内存模型仅有一份上级虚基类中的成员，区别于普通的多继承，对于普通的多继承体系，是无法保证最上级基类往后所延伸到的最终派生在内存中的模型仅保有一份该最上级基类中的成员信息，正如 **_菱形继承_** 所存在的问题，最上级派生中的成员 `SEX` 衍生至最下级派生 `HYBIRD` 中其实是有两份 `SEX` 成员信息的，它们分别继承自 `DOG` & `CAT`，而当 `CAT & DOG` 使用虚继承的方式继承自 `ANIMAL` 时，它们所向下衍生出的派生其内存模型是仅有一份来自于最上级基类中的成员 `SEX` 的信息的，其从根本上解决了多继承可能存在的成员重复的问题和成员二义性可能导致的 OOP 逻辑错误的问题

```cpp
class ANIMAL {
public:
  char SEX;
};

class DOG : public virtual ANIMAL { };
class CAT : public virtual ANIMAL { };

class HYBIRD : public DOG, public CAT { };
```

**_虚继承内部实现_**

我们都知道，一起存在着一段继承体系的类，其在实例时会 **_优先_** 初始化其所继承的最上级基类(默认情况下调用基类的默认构造函数)的所有成员至以子类实例为基准所构建的内存段上，然后再以父类中的成员所构建的数据所在内存地址的结束位置继续往下初始化子类中的成员数据，虚继承同样于此，但是放在其派生类的内存首段的数据并不再是虚基类中的成员数据，而是一个名为 **_vbptr_** 的指针，该指针指向了一个名为 **_vbtable_** 的表格，该表格维护了指向其的 **_vbptr_** 的指针在内存中的首地址到虚基类中的成员信息的偏移量，而<font color = "red">虚基类中的成员数据实际上被放到了派生类在初始化完毕内部成员后继续往下所延伸的地址上</font>，依据菱形继承中，`ANIMAL DOG CAT HYBIRD` 之间的继承关系，我们把 `DOG` 和 `CAT` 改用虚继承的方式继承自 `ANIMAL`，那么其内存模型图如下

```cpp
class ANIMAL {
public:
  char SEX;
};

class DOG : public virtual ANIMAL { };
class CAT : public virtual ANIMAL { };

class HYBIRD : public DOG, public CAT { 
public:
  char *name;    
};
```

```text
class HYBIRD   size(11):
   +---
 0 | +--- (base class DOG)
 0 | | {vbptr}
   | +---
 4 | +--- (base class CAT)
 4 | | {vbptr}
   | +---
 8 | name
   +---
   +--- (virtual base ANIMAL)
12 | SEX
   +---

HYBIRD::$vbtable@DOG@:
 0 | 0
 1 | 8 (HYBIRDd(DOG+0)ANIMAL)

HYBIRD::$vbtable@CAT@:
 0 | 0
 1 | 4 (HYBIRDd(CAT+0)ANIMAL)
```


我们会发现，原本 `HYBIRD` 的内存首段信息本该出现的 `DOG` 和 `CAT` 的数据都替换为 **_vbptr_** 的形式了，而本该出现的两个 `SEX` 成员变成了只有一个(共享机制)并被放在派生类成员初始化的数据往后延生的内存段上(virtual base ANIMAL)，<font color = "red">当我们想访问 `BYBIRD` 的基类所继承下来的 `SEX` 数时，会依据指针 **_vbptr_** 所指向的 **_vbtable_**，在里头找到该 **_vbptr_** 指针在内存中的首地址到虚基类中的成员信息的偏移量，然后再依据这个偏移量从派生类的首地址开始偏移，以找到仅有的 SEX 成员</font>，保证调用不会存在二义性，我们可以简单的理解为 : <font color = "red">不管采用什么样的方式去调用(直接通过子类的实例亦或者通过 :: 去引用具体某个基类的作用域)基类中的成员信息，所获取到的始终都是同一个最上级虚基类的成员信息</font>

稍微扩展一下的是，`DOG` 和 `CAT` 都是采用的虚继承的方式去继承了 `ANIMAL`，也就是说放在他们各自的角度来看，`CAT` 和 `DOG` 的实例都各自维护了各自的 **_vbptr_** 的指针和各自的 **_vbtable_**，而同时派生自 `DOG` 和 `CAT` 的派生类 `HYBIRD` 来说，由于继承的传递性那么它就分别拥有了 `DOG` 和 `CAT` 各自维护的 `vbptr` 和 `vbtable`，也就是说 `HYBIRD` 的最终内存模型是拥有两个 **_vbptr_** 和 **_vbtable_** 的，但是由于该 **_vbptr_** 所维护的都是同属于一个虚基类中的成员信息，所以就算最下级派生类中出现了重复的 **_vbptr_** 和 **_vbtable_** 也不会造成二义性的调用，因为其最终的调用都会依据当前 **_vbptr_** 所在的地址和不同的偏移量去找到共同的最上级虚基类中的成员信息

虚继承到底是 **_虚_** 在哪里？虚就虚在所继承的基类中的成员信息，<font color = "red">当一个类使用的是虚继承的方式继承了一个虚基类，那么其所衍生到的派生类真正继承下来的仅仅只是那个因为使用虚继承的关系而生成的 **_vbptr_** 的指针和所指向的 **_vbtable_**，真实的，其继承自虚基类的成员信息由 **_vbptr_** 和 **_vbtable_** 所共同维护着</font>

**_虚继承的构造顺序_**

<font color = "red">一个存在虚基类的继承体系中，虚基类的构造函数将交由 **_当前所初始化的、某个虚基类往下所派生的子类_** 来负责显式调用构造(如果当前类的上级基类也同样显式调用了虚基类的构造，则该调用失效)</font>，并且，<font color = "red">在构造的过程中，虚基类总是会被优先调用构造的(假设虚基类还存在基类的情况)(该优先构造的工作是用于初始化虚基类所衍生出来的 **_vbptr_** 指针和其所指向的 **_vbtable_**)，在完成虚基类的优先初始化工作后则按照正常的继承关系的初始化方式继续完成当前实例的构造，即从最上层基类逐层往下初始化直接基类(不包含虚基类)和直接基类往下所派生的子类</font>

如下面的代码所示，我们在虚基类的上层还增加了一个最终基类 `BIOLOGICAL(物种)`，它用于反馈一个存在虚基类的继承体系中，虚基类永远都是永远初始化的情况，其次，我们在 `DOG CAT HYBIRD` 都分别显式的调用了虚基类的构造，这用于反馈虚基类的显式构造的调用永远都是交由当前所实例化的类来完成这一情景

```cpp
#include <iostream>
using namespace std;

class BIOLOGICAL {
public:
  BIOLOGICAL(){
    cout << "BIOLOGICAL CONSTRUCTOR" << endl;
  };
  BIOLOGICAL(char _SPECIES)
    : SPECIES(_SPECIES) {};
public:
  char SPECIES = 'P';
};

class ANIMAL : public BIOLOGICAL {
public:
  ANIMAL() : BIOLOGICAL() {}
  ANIMAL(char _SEX)
    : SEX(_SEX) {
    cout << "ANIMAL CONSTRUCTOR" << endl;
  }
public:
  char SEX = 'K';
};


class DOG : public virtual ANIMAL {
public:
  DOG(char *name)
    : ANIMAL('D'), d_name(name) {
    cout << "DOG CONSTRUCTOR" << endl;
  }
public:
  char *d_name;
};


class CAT : public virtual ANIMAL {
public:
  CAT(char *name)
    : ANIMAL('C'), c_name(name) {
    cout << "CAT CONSTRUCTOR" << endl;
  }
public:
  char *c_name;
};


class HYBIRD : public DOG, public CAT {
public:
  HYBIRD(char *name, char _SEX)
    : ANIMAL(_SEX), DOG(name), CAT(name) {
    cout << "HYBIRD CONSTRUCTOR" << endl;
  }

public:
  int h_age = 0x400;
};


int main(void) {
  HYBIRD bird((char *)"hello,hybird", 'H');

  CAT cat((char *)"hello,cat");

  DOG dog((char *)"hello,dog");

  return EXIT_SUCCESS;
}
```

**_通过虚继承的方式实现多继承_**

<font color = "red">当一个类中继承了多个虚基类，该类的实例其内存模型也仅有一个 **_vbptr_** 的指针和 **_vbtable_**，但是，**_vbtable_** 中会保存多个相对于当前 **_vbptr_** 到来自于不同虚基类中的成员信息的偏移量</font>(以保证能够成功的获取到不同虚基类中的成员信息)，区别于上一小节，上一小节是由于一个类继承了两个不同的基类但是它们都继承自同一个虚基类，那么作为下级派生就应当拥有上级基类中各自的成员信息，也就是两个 **_vbptr_** 和 **_vbtable_**

```cpp
class DOG { 
public:
  char *d_name = (char *)"DOG!";
};

class CAT { 
public:
  char *c_name = (char *)"CAT!";
};

class HYBIRD : public virtual DOG, public virtual CAT { 
public:
  char *h_name;    
};
```

```text
class HYBIRD   size(16):
   +---
 0 | {vbptr}
 4 | name
   +---
   +--- (virtual base DOG)
 8 | d_name
   +---
   +--- (virtual base CAT)
12 | c_name
   +---

HYBIRD::$vbtable@:
 0 | 0
 1 | 8  (HYBIRDd(HYBIRD+0)DOG)
 2 | 12 (HYBIRDd(HYBIRD+0)CAT)
```

继上一段代码的情景，<font color = "red">我们要保证一个类所继承的多个虚基类中并不会出现同名的成员信息，否则同样会出现成员调用的二义性</font>，这里需要区别于[菱形继承](#菱形继承)中所造成二义性的情景，菱形继承造成的二义性的根本原因是因为最下级派生所继承的多个基类都用用着共同的成员属性(它们都继承自同一个最上级基类)而导致最下级派生中存在着多个同名的成员属性，这种情况之下我们对于最下级派生的基类都采用虚继承的方式使它们继承自同一个最上级基类，那么转换到最下级派生的视角来看，原有的继承下来的重名成员都会因为其上级基类是使用虚继承的关系，所以真正被继承下来的都是 **_vbptr_** 和 **_vbtable_**，我们可以理解为在这种情况下重名的成员转变成 **_vbptr_** 和 **_vbtable_**，但由于他们所继承下来的属性都同属于一个虚基类上的成员信息，故在这种情况下不管我们是对该理应被重名的成员采取任何的访问方式都不会造成二义性，那么假设我们对于当前类采用虚继承的方式继承了多个虚基类，并且 多个虚基类中存在着同名的成员，这时候就又会出现二义性的问题了，<font color = "red">该二义性的发生并不是由本身的继承关系而造成的，是因为虚继承本身继承下来的成员就存在二义性所产生的，即 **_vbptr_** 和 **_vbtable_** 本身就维护着同名的成员</font>，所以这种情况之下并不能依赖于 **_为了解决本身继承所产生的二义性关系的虚继承_** 来解决，只能在采用虚继承继承了多个虚基类的派生亦或者其下级派生在调用产生二义性成员时使用 :: 引用具体某个虚基类的作用域的方式来避免这一问题，下面的代码则展示了该问题

```cpp
class DOG {
public:
  char *name = (char *)"DOG!";
};

class CAT {
public:
  char *name = (char *)"CAT!";
};

class HYBIRD : public virtual dog, public virtual cat { };     
```

```text
class HYBIRD    size(12):
   +---
 0 | {vbptr}
   +---
   +--- (virtual base DOG)
 4 | name
   +---
   +--- (virtual base CAT)
 8 | name
   +---
                 
HYBIRD::$vbtable@:
 0 | 0
 1 | 4 (HYBIRDd(HYBIRD+0)DOG)
 2 | 8 (HYBIRDd(HYBIRD+0)CAT)    
```


<br/>

<span id = "虚函数"></span>

#### 虚函数

虚函数的存在并不陌生，即 : <font color = "red">如果一个基类的指针(引用)所指向的是其派生实例在内存中的首地址并且该派生对于基类中的虚函数进行了重写，那么我们在使用这个基类的指针(引用)在调用其虚函数时，所调用的是派生类中的重写实现</font>

<font color = "red">需要注意的是，是只有使用基类的类型的指针(引用类型)去指向了重写了基类中的虚函数的派生的实例在内存中的首地址，并通过该指针去对虚函数进行调用才能够符合虚函数重写覆盖调用的定义的，因为只有在这种情境之下的声明才符合多态的定义</font>，具体原因参照[里式转换](#里式转换)

**_如何编写虚函数_**

一个成员函数的生面前添加 **_virtual_** 关键字来完成能够完成虚函数的定义，当一个类中声明了一个虚函数，那么它所派生出来的子类亦或者子类往下继续延生的派生都可以 <font color = "red">**_选择性地_**</font> 完成对它的重写，对于虚函数的重写有两种方式 : 

- 在派生类中声明了一个相同函数签名(相同返回值、相同函数名、相同形参列表)的函数

- 在派生类中声明了一个相同函数签名(相同返回值、相同函数名、相同形参列表)的函数，并在结尾使用了 **_override_** 关键字进行修饰

两种重写虚函数的方式所达到的效果是一样的，意为该函数重写了上级基类的虚函数，不同的是，<font color = "red">第二种方法如果在其基类中并没有找到对应 函数签名的虚函数时，则会编译报错，反观第一种重写方案，当基类中并没有对应函数签名的虚函数时编译并不会报错</font>，该函数仅仅只是被当成是当前派生类中的一个成员函数，在 cpp 标准中规定，对于虚函数的重写更加推荐的方式则为第二种方案

**_虚函数的内部实现_**

当一个类中声明了一个虚函数后，那么该实例的创建编译器会附带创建一个名为 **_vfptr_** 的指针，并插入到在其实例在内存中的首段位置，该指针指向了一个名为 **_vftable_** 的表格，该表格所维护的则为 <font color = "red">**_在基类中声明为虚的成员函数亦或者下级派生所重写的虚函数 在内存中的首地址_**</font>，当我们通过该类的实例去调用这个虚函数时，编译器并不会直接依照所调用函数的首地址进行调用，而是会根据 **_vfptr_** 指针所指向的 **_vftable_** 中，在其内部寻找所维护的函数地址并进行调用

<font color = "red">假设声明了虚函数的类进行了向下的派生，基类中的成员所衍生到的派生类随同一并继承下来的还会包括那个因为 虚函数 所生成的 **_vfptr_** 指针和其所指向的 **_vftable_**，如果在当前的派生中显示的指定了对于基类中的虚函数进行了重写，那么编译器会把当前派生中所重写至基类中的虚函数的成员函数在内存中的首地址 在 **_vftable_** 当中替换掉原本属于上级基类中的成员函数的首地址，故这时候 **_vftable_** 中所维护的函数地址其实为派生中所重写的虚函数，那么当我们使用一个指向派生类实例在内存中的首地址的基类类型的指针去调用虚函数时，所调用的则为在派生类中的重写实现</font>，如下面的代码 :

```cpp
class Animal {
public:
  Animal() {
    cout << "ANIMAL CONSTRUCTOR" << endl;
  }
public:
  virtual void speak() {
    cout << "ANIMAL SPEACKING!" << endl;
  }
public:
  int a_age;
};

class Cat : public Animal {
public:
  Cat() {
    cout << "CAT CONSTRUCTOR" << endl;
  }
public:
  void speak() override {
    cout << "CAT SPEAKING" << endl;
  }
public:
  int c_age;
};
```

```text
class Cat size(12):
   +---
 0 | +--- (base class Animal)
 0 | | {vfptr}
 4 | | a_age
   | +---
 8 | c_age
   +---

Cat::$vftable@:
   | &Cat_meta
   |  0
 0 | &Cat::speak
```

由于继承的延续性，**_vftable_** 会随着往下的派生而继续延生，也就是说，一段继承体系中，继续往下的某一个派生如果重写了上级基类中的虚函数，那么其重写的虚函数的首地址同样会覆盖掉 **_vftable_** 中所维护的函数地址，否则不会(**_可以选择性的进行重写_**)，其实简而言之，虚函数的调用依据永远都是依照 **_vftable_** 来进行的，而 **_vftable_** 则根据我们当前所实例化的类的重写依据的实现而实现，就上面的代码来说，我们实例化的是 `Cat` 并使用其 **_基类指针_** 去接收，那么 **_vftable_** 中最终所纳入的实现则为 `Cat` 中所重写的虚函数的首地址，假设 `Cat` 又往下衍生了一个派生，并且派生中重写了最上级基类中的虚函数，反之 `Cat` 并没有，那么我们在使用 **_基类指针_** 去接收最下级派生(Cat往下的派生)的实例的首地址的时候，**_vftable_** 则会依照 `Cat` 往下的派生所重写的函数而实现，反之在这种情境之下我们使用 **_基类指针_** 再去接收 `Cat` 实例的时候，这时候重写的依据就不再是 `Cat` 了，因为 `Cat` 中压根就没有进行过重写，那么 **_vftable_** 所维护的还是最上级基类中的实现

简而言之，<font color = "red">虚函数到底是使用当前继承体系中哪一个派生的重写，根据我们所具体实例化的对象来决定</font>

<br/>

<span id = "虚析构"></span>

#### 虚析构

对于一个存在着一段继承关系的类来说(最下级派生)，我们单纯的创建了针对于它的实例，那么当它即将被释放时，析构的调用惯例(这里仅仅讨论的是析构的调用顺序，并不是释放，对于释放而言自然是全都会被释放)是从内向外而进行的，即从最下层的派生中开始逐步往上层进行调用，但是对于需要进行多态操作的类来说，我们往往是使用一个基类去接收一个派生类的赋值，以通过最上级基类在保有派生类中的 **_'特性'_** 的情况下完成多态的操作

**_对于普通的在栈中所构建的多态而言_**，其释放顺序自然是标准的由内向外的顺序，因为在栈中所构建的多态，往往是需要我们在当前栈帧(函数)上下文中先去构建一个派生的实例，再使用上级基类类型的指针去接收这个下级派生实例在内存中的首地址，然后再通过这个类型为基类的指针去完成多态的操作，而这种操作之中，<font color = "red">重点的是，我们在当前栈帧上下文中先手动的构建了作为下级派生的实例，那么自然作为栈帧出栈时自然也会遵循着我们所构建的这个下级派生的实例，由内向外的进行析构的逐层调用</font>

**_但是对于在堆中所构建的多态而言_**，我们往往都是直接 `new` 一个派生类型实例并 **_直接_** 使用 **_基类类型的指针_** 去接收，那么当我们去 `delete` 释放这块内存的时候，<font color = "red">因为 `delete` 所释放的视角是以基类类型为开始的</font>，那么在这种情况之下，`delete` 虽然是能够释放掉所 `new` 的内存(确保所 `new` 出来的内存首地址是正确)，但是其继承体系的析构调用顺序仅仅只是从当前 **_基类类型_** 中开始，而不是标准的从内向外了，当然，如果我们把上面的情景转换为使用的是 **_当前所 new 的派生类型的指针做为接收_**，那么当我们在 delete 的时候，由于视角是从下级派生所开始，那么其析构的调用顺序也是由内向外的了

其实归根结底，仔细研究上面的两种情景我们会发现，<font color = "red">释放的顺序到底是由内向外还是仅仅只是作为自身往往都是由编译器在我们的代码中所看到的具体是由哪一层次的类来操作的视角来决定</font>，就拿情景一来说，由于我们在栈中显示的声明并使用了下级派生的变量，那么其在释放的时候，析构的调用顺序也自然依照这个下级派生开始由内向外进行释放，<font color = "red">而情景二中由于我们所声明的真正的变量是 **_基类类型_** (虽然内部的实现是其下级派生) 并且在 delete 的时候也是从 **_基类类型_** 这个层次的类作为视角而开始，故其即将被释放时，析构的调用顺序仅仅只是从 **_基类类型_** 这个上级基类开始，那么就有可能导致下级派生中的析构因为无法正常的调用但是下级析构却会维护着当前层次中声明在堆中的内存的生命周期而导致内存泄漏的问题，针对这种情景，我们这就需要引入 **_虚析构_** 的使用了</font>

虚析构，它能够保证我们所释放的成员以 **_上级基类_** 作为视角时，也能够在调用 **_上级基类_** 的虚构函数前会优先调用作为基类的派生并且重写了的虚析构的实现，作为基类中的 **_虚析构源_** 和其下级派生所 **_重写的虚析构_**，其同样也会由 **_vfptr_** 和 **_vftable_** 所维护着，如果在下一级派生中重写了上层的虚析构的话，则会在当前派生的上下文中替换掉 **_vftable_** 中关于上级虚析构在内存中的首地址，否则不会(可以选择性地进行重写，其原理和虚函数一致)，那么当我们释放的成员是以 **_上级基类_** 做为视角的情况下，则会依照 **_vftable_** 中所维护的当前继承体中的虚构函数的具体实现来决定由内向外的释放顺序

```cpp
#include <iostream>
using namespace std;

#include <string.h>

class Animal {
public:
  Animal(int _age)
    : a_age(_age) {
    cout << "ANIMAL CONSTRUCTOR" << endl;
  }
  virtual ~Animal() {
    cout << "ANIMAL DESCRTUCTOR" << endl;
  }

public:
  int a_age;
};


class Cat : public Animal {
public:
  Cat(int _age, char *_name)
    : Animal(_age) {
    cout << "CAT CONSTRUCTOR" << endl;
    this->name = new char[strlen(_name) + 1];
    strcpy(this->name, _name);
  }
  ~Cat() override {
    cout << "CAT DESTRUCTOR" << endl;
    delete[] this->name;
  }

public:
  char *name = nullptr;
};


class HEITAN : public Cat {
public:
  HEITAN(int _age, char *name)
    : Cat(_age, name) {
    cout << "HEITAN CONSTRUCTOR" << endl;
  }
  ~HEITAN() override {
    cout << "HEITAN DESTRUCTOR" << endl;
  }
};

int main(void) {
  Animal *animal = new HEITAN(1, (char *)"heitan");
  delete animal;

  return EXIT_SUCCESS;
}
```

```text
class HEITAN    size(12):
   +---
 0 | +--- (base class Cat)
 0 | | +--- (base class Animal)
 0 | | | {vfptr}
 4 | | | a_age
   | | +---
 8 | | name
   | +---
   +---
HEITAN::$vftable@:
   | &HEITAN_meta
   |  0
 0 | &HEITAN::{dtor} 
```

需要补充一点的是，虚析构同样是遵循着[虚函数](#虚函数)小节中所说明的特性，因为它本身就是一种虚函数，只是是一种虚构函数，我们无需把它想多过于复杂，只用把它理解为虚析构和虚析构的重写能够决定一段声明在堆中的多态继承体系的析构函数调用顺序和时机即可 

<br/>

<span id = "纯虚函数"></span>

#### 纯虚函数

<font color = "red">纯虚函数即声明的虚函数的实现赋值为 0，在这种情况之下，作为其下级派生则 **_必须_** 要对其进行重写，否则会导致编译不通过</font>，并且，<font color = "red">一个类中一旦出现了一个纯虚函数，那么这个类就被编译器认作为一个 抽象类，在 cpp 中对于抽象类的特性仅有不能实例化自身这一点</font>

对于纯虚函数而言，它其实和普通的虚函数是一样的，只是对于纯虚函数而言多了一条限制是其往下的派生必须要对该纯虚进行重写，否则会编译不通过

```cpp
#include <iostream>
using namespace std;

#include <string.h>

class Animal {
public:
  Animal() {
    cout << "animal constructor" << endl;
  }
  
  /* 纯虚函数 */
  virtual void speak() = 0;

  virtual ~Animal() {
    cout << "animal destructor" << endl;
  };
};

class Cat : public Animal {
public:
  Cat() {
